Revit 2027 API
BasicLossFactor(BasicLossFactor) Constructor
 Creates a copy of the given basic loss factor object
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BasicLossFactor(
	BasicLossFactor other
)
Public Sub New (
	other As BasicLossFactor
)
public:
BasicLossFactor(
	BasicLossFactor^ other
)
new :
        other : BasicLossFactor -> BasicLossFactor
Parameters
other BasicLossFactor
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BasicLossFactor Class
BasicLossFactor Overload
Autodesk.Revit.DB.Lighting Namespace